In [309]:
import pandas as pd
import numpy as np

In [310]:
consumidores = pd.read_csv("desafio1.csv")

In [311]:
consumidores.head(3)
#consumidores['estado_residencia'].nunique()

,RowNumber,id,sobrenome,pontuacao_credito,estado_residencia,genero,idade,nivel_estabilidade,saldo_conta,numero_produtos,possui_cartao_de_credito,membro_ativo
0,1,e7f44fcbd380d4cef7e6c232cc7e37895c3fd197,6d6e0aa1b9b413e442e2fb68df14b4fc3f91de50,619,SC,F,42,2,0.00,1,1,1
1,2,28dcb083ad90512da16b9430085c2cddb8ca5e12,48e1ad846796fa314f1b4a6702b83343eb5482c5,608,RS,F,41,1,83807.86,1,0,1
2,3,774bc378f787438c9c7594e536787d07a097a54b,f2b29d5d934de615812b697132e767dea0f1e9e2,502,SC,F,42,8,159660.80,3,1,0

In [312]:
consumidores.isna().sum()

RowNumber                   0
id                          0
sobrenome                   0
pontuacao_credito           0
estado_residencia           0
genero                      0
idade                       0
nivel_estabilidade          0
saldo_conta                 0
numero_produtos             0
possui_cartao_de_credito    0
membro_ativo                0
dtype: int64

In [313]:
consumidores.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7000 entries, 0 to 6999
Data columns (total 12 columns):
RowNumber                   7000 non-null int64
id                          7000 non-null object
sobrenome                   7000 non-null object
pontuacao_credito           7000 non-null int64
estado_residencia           7000 non-null object
genero                      7000 non-null object
idade                       7000 non-null int64
nivel_estabilidade          7000 non-null int64
saldo_conta                 7000 non-null float64
numero_produtos             7000 non-null int64
possui_cartao_de_credito    7000 non-null int64
membro_ativo                7000 non-null int64
dtypes: float64(1), int64(7), object(4)
memory usage: 656.3+ KB

In [314]:
#media
media = consumidores.groupby('estado_residencia')['pontuacao_credito'].mean().reset_index()
#media.reset_index()
#media.rename(columns={'estado_residencia':'estado'}) 

#media = media['estado_residencia'] = media.index
media

  estado_residencia  pontuacao_credito
0                PR         648.961294
1                RS         651.105143
2                SC         649.537653

In [315]:
consumidores.dtypes

RowNumber                     int64
id                           object
sobrenome                    object
pontuacao_credito             int64
estado_residencia            object
genero                       object
idade                         int64
nivel_estabilidade            int64
saldo_conta                 float64
numero_produtos               int64
possui_cartao_de_credito      int64
membro_ativo                  int64
dtype: object

In [316]:
#mediana
mediana = consumidores.groupby('estado_residencia')['pontuacao_credito'].median().reset_index()
mediana

  estado_residencia  pontuacao_credito
0                PR                650
1                RS                650
2                SC                653

In [317]:
#moda
moda = consumidores.groupby('estado_residencia')['pontuacao_credito'].apply(pd.Series.mode).reset_index()

moda

  estado_residencia  level_1  pontuacao_credito
0                PR        0                850
1                RS        0                850
2                SC        0                850

In [318]:
#desvio padrao
desvio_padrao = consumidores.groupby('estado_residencia')['pontuacao_credito'].std().reset_index()
desvio_padrao



#Usando o groupby com a função agg
#consumidores.groupby('estado_residencia').agg({'estado_residencia': 'unique',
#                                     'pontuacao_credito': 'std'})

  estado_residencia  pontuacao_credito
0                PR          98.607186
1                RS          95.136598
2                SC          97.233493

In [319]:
#df_concat = consumidores.concat([media, mediana, moda, desvio_padrao,])
#filtro = media['estado_residencia','pontuacao_credito'].reset_index()

df_total = moda.merge(mediana, on='estado_residencia', how='right').drop(['level_1'], axis=1)
df_total

#df_concat

  estado_residencia  pontuacao_credito_x  pontuacao_credito_y
0                PR                  850                  650
1                RS                  850                  650
2                SC                  850                  653

In [320]:
df_total.rename(columns={'pontuacao_credito_x': 'moda', 'pontuacao_credito_y': 'mediana'}, inplace=True)
df_total

  estado_residencia  moda  mediana
0                PR   850      650
1                RS   850      650
2                SC   850      653

In [321]:
df_total = df_total.merge(media,on='estado_residencia', how='right')
df_total

  estado_residencia  moda  mediana  pontuacao_credito
0                PR   850      650         648.961294
1                RS   850      650         651.105143
2                SC   850      653         649.537653

In [322]:
df_total.rename(columns={'pontuacao_credito': 'media'}, inplace=True)
df_total

  estado_residencia  moda  mediana       media
0                PR   850      650  648.961294
1                RS   850      650  651.105143
2                SC   850      653  649.537653

In [323]:
df_total = df_total.merge(desvio_padrao,on='estado_residencia', how='right')
df_total.rename(columns={'pontuacao_credito': 'desvio_padrao'}, inplace=True)
df_total

  estado_residencia  moda  mediana       media  desvio_padrao
0                PR   850      650  648.961294      98.607186
1                RS   850      650  651.105143      95.136598
2                SC   850      653  649.537653      97.233493

In [324]:
df_total.index.is_unique

True

In [326]:
#df.to_json(r'Path to store the exported JSON file\File Name.json')
df_total.to_json('submission.json', orient='index')